IDENTIFICATION DIVISION.
PROGRAM-ID. WriteLetters.

DATA DIVISION.
FILE SECTION.
FD  LETTERS-FILE ASSIGN TO 'letters.txt'
    LABEL RECORDS ARE STANDARD
    RECORD CONTAINS 1 CHARACTER
    RECORDING MODE F
    BLOCK CONTAINS 0
    DATA RECORD IS LETTER-RECORD.
01  LETTER-RECORD PIC X.

WORKING-STORAGE SECTION.
01  LETTERS-TABLE.
    05  LETTER OCCURS 3 TIMES PIC X VALUE ' '.
01  INDEX-VAR PIC 9(1) VALUE 1.

PROCEDURE DIVISION.
    MOVE 'abc' TO LETTERS-TABLE
    OPEN OUTPUT LETTERS-FILE
    PERFORM WRITE-LETTERS
    CLOSE LETTERS-FILE
    STOP RUN.

WRITE-LETTERS.
    PERFORM VARYING INDEX-VAR FROM 1 BY 1 UNTIL INDEX-VAR > 3
        MOVE LETTERS-TABLE (INDEX-VAR) TO LETTER-RECORD
        WRITE LETTER-RECORD
    END-PERFORM.
